{
  "categories": [
    {
      "id": "fun-zone",
      "name": "Fun Zone",
      "color": "#FFC300",
      "subcategories": [
        { "id": "would-you-rather", "name": "Would You Rather", "questions": [
          "Would you rather relive one perfect day or skip one painful memory forever?",
          "Would you rather read minds for a day or be unreadable forever?",
          "Would you rather always be 10 minutes early or 10 minutes late?",
          "Would you rather win every argument or never start any?",
          "Would you rather forget your favorite memory or never create a new one?",
          "Would you rather have unlimited time or unlimited energy?",
          "Would you rather travel the world for free or eat anywhere for free?",
          "Would you rather find true love or true purpose?",
          "Would you rather share your deepest secret or hear someone else’s?",
          "Would you rather be famous for talent or respected for character?",
          "Would you rather restart your life at age 10 or fast-forward to the future?",
          "Would you rather lose all your photos or all your messages?",
          "Would you rather be able to pause time or rewind time?",
          "Would you rather get one honest answer or one guaranteed wish?",
          "Would you rather keep your past or rewrite it completely?",
          "Would you rather live with no music or no movies?",
          "Would you rather live in your favorite memory or your dream future?",
          "Would you rather be loved loudly or quietly but deeply?",
          "Would you rather be known for your humor or your wisdom?",
          "Would you rather have a friend who’s brutally honest or gently supportive?",
          "Would you rather be able to erase one mistake or relive one success?",
          "Would you rather stay up late talking or fall asleep in peace?",
          "Would you rather cry from laughter or laugh from crying?",
          "Would you rather know the truth even if it hurts or stay comfortably unaware?",
          "Would you rather lose your ability to lie or your ability to trust?",
          "Would you rather explore the ocean or explore space?",
          "Would you rather be remembered as kind or unforgettable?",
          "Would you rather be emotionally transparent or emotionally mysterious?",
          "Would you rather have infinite confidence or infinite patience?",
          "Would you rather reveal a secret or hear someone reveal one about you?"
        ] },
        { "id": "juicy-convos", "name": "Juicy Convos", "questions": [] },
        { "id": "spicy-edition", "name": "Spicy Edition", "questions": [] }
      ]
    }
  ]
}