{
  "categories": [
    {
      "id": "emotional-zone",
      "name": "Emotional Zone",
      "color": "#9D4EDD",
      "subcategories": [
        {
          "id": "dream-talks",
          "name": "Dream Talks",
          "questions": [
            "What’s a dream you’ve never said out loud because it feels too big?",
            "If fear didn’t exist for 24 hours, what would you attempt?",
            "What’s a goal you’re secretly working on in your head?",
            "What’s something you stopped dreaming about but want to revive?",
            "What does your ideal future day look like from morning to night?",
            "What’s something you hope you’ll never lose passion for?",
            "What’s a dream you achieved that still doesn’t feel real?",
            "What’s a dream that scares you because it actually could happen?",
            "What’s something you want to learn but always delay?",
            "What’s a dream you had as a child that still lives inside you?",
            "What’s one thing that always motivates you no matter what?",
            "What part of your future do you think about the most?",
            "What dream feels impossible but you want anyway?",
            "What’s something that would make your younger self proud?",
            "What dream feels too personal to share with most people?",
            "What’s a dream that changed as you grew older?",
            "What’s a dream you let go of — and why?",
            "What’s your biggest dream for the next five years?",
            "What’s a dream you’d chase if money wasn’t a worry?",
            "What’s one step you could take toward a dream today?",
            "Whose support would mean the most in achieving your dream?",
            "What’s a dream you think others wouldn’t understand?",
            "What dream feels like it belongs to the world, not just you?",
            "What’s something you’re scared to want too badly?",
            "What dream feels like “home” when you imagine it?",
            "What’s a dream you’re afraid to say out loud because it might fail?",
            "What’s one thing you want your future self to thank you for?",
            "What’s a dream you’re willing to struggle for?",
            "What’s a dream you’d choose even if nobody supported it?",
            "What’s a dream you hope becomes part of your real story?"
          ]
        },
        {
          "id": "late-night-talks",
          "name": "Late Night Talks",
          "questions": [
            "What thoughts hit you the hardest at night?",
            "When was the last time you cried without a specific reason?",
            "What’s something you overthink but can’t stop doing?",
            "What’s a fear you don’t talk about because it sounds irrational?",
            "Who was the last person who truly understood you?",
            "What’s something that hurts, but you pretend it doesn’t?",
            "What’s the heaviest thing you’re carrying right now?",
            "What do you wish people asked you more often?",
            "What’s one memory you replay late at night?",
            "Who’s someone you miss but don’t reach out to anymore?",
            "What’s something you’re scared to admit about yourself?",
            "What keeps you awake even when you’re tired?",
            "What’s one thing you wish you didn’t understand so well?",
            "What’s a lie you tell yourself to feel better?",
            "What’s a truth you try to ignore but can’t?",
            "What’s something you wish you learned earlier?",
            "What’s a thought you keep buried on purpose?",
            "What’s the loneliest you’ve ever felt?",
            "What’s something you’re afraid to lose?",
            "What’s something that comforts you instantly?",
            "What’s a mistake that still echoes in your mind?",
            "What’s something you want to outgrow emotionally?",
            "What’s a feeling you don’t know how to describe?",
            "What’s one thing you wish you could unhear or unsee?",
            "What’s something you want to forgive yourself for?",
            "What’s a moment that made you realize life is short?",
            "What’s something you pretend not to care about but do deeply?",
            "What’s one thing you wish could change overnight?",
            "What are you tired of hiding from people?",
            "What’s something you want to let go of before the year ends?"
          ]
        },
        {
          "id": "toxic-truths",
          "name": "Toxic Truths",
          "questions": [
            "What’s a behavior you know is toxic but still struggle to stop?",
            "What’s something you accepted for too long because you didn’t want conflict?",
            "What’s a toxic trait you recognize in yourself?",
            "What’s one pattern you fall into again and again?",
            "Who introduced you to the idea of unhealthy love?",
            "What’s something you’re finally learning to say “no” to?",
            "What’s a truth you avoided because it hurt too much?",
            "What’s one sign of toxicity you wish you noticed earlier?",
            "What’s something you pretend is a joke but actually hurts?",
            "What’s a toxic cycle you hope ends with you?",
            "What’s something you’ve tolerated that you shouldn’t have?",
            "What’s a trait you excuse too easily in people?",
            "What’s a situation you stayed in long after it stopped serving you?",
            "What’s one lie you believed for far too long?",
            "What’s a painful truth that eventually set you free?",
            "What’s a toxic habit you picked up from someone close?",
            "What’s a boundary you wish you enforced sooner?",
            "What’s a red flag you ignored even though you knew better?",
            "What’s something you regret giving someone access to?",
            "What’s one thing you refuse to tolerate anymore?",
            "What’s a toxic pattern you fear falling back into?",
            "What’s a truth that hit you harder than it should’ve?",
            "What’s an apology you never got but deserved?",
            "What’s a lesson you learned the hardest way possible?",
            "What’s one thing you need to detox from emotionally?",
            "What’s something you only realized was wrong after leaving it?",
            "What boundary makes you feel safest?",
            "What’s a toxic thought that still whispers sometimes?",
            "What’s something you wished you walked away from sooner?",
            "What’s the healthiest thing you’ve done for yourself recently?"
          ]
        },
        { "id": "long-distance-vibes", "name": "Long Distance Vibes", "questions": [] }
      ]
    }
  ]
}