{
  "categories": [
    {
      "id": "relationship-zone",
      "name": "Relationship Zone",
      "color": "#FF6B6B",
      "subcategories": [
        {
          "id": "couple-questions",
          "name": "Couple Questions",
          "questions": [
            "What’s the one habit of mine that secretly melts your heart?",
            "When did you first realize we had something special?",
            "What’s your favorite way to make up after an argument?",
            "If our story was a movie, what would the title be?",
            "How do you usually show love when words aren’t enough?",
            "What’s one thing I do that always makes you laugh?",
            "Which moment of ours do you wish you could relive?",
            "What song perfectly describes us?",
            "What makes our relationship different from others?",
            "If you could change one thing about how we communicate, what would it be?",
            "What’s something you love about me but rarely say?",
            "How do you know when I’m upset without me saying it?",
            "What’s your favorite kind of date with me?",
            "Which of our memories do you think I’ve forgotten but you still remember?",
            "What small things do I do that mean the most to you?",
            "If we switched roles for a day, what would surprise you most about my life?",
            "What makes you feel closest to me?",
            "What’s your favorite “us” tradition?",
            "How has being together changed you as a person?",
            "What’s one thing we should do more often as a couple?",
            "Which of our inside jokes never gets old?",
            "What’s something you learned about love because of me?",
            "If you had to describe our relationship in three words, what would they be?",
            "What’s one memory that makes you smile instantly?",
            "When was the last time I made you feel really loved?",
            "What’s your favorite time of day to spend with me?",
            "What do you think keeps our spark alive?",
            "What makes you most grateful for our relationship?",
            "What’s something I don’t realize you appreciate about me?",
            "What does being “in love” mean to you now compared to before us?"
          ]
        },
        {
          "id": "for-soulmates",
          "name": "For Soulmates",
          "questions": [
            "What makes you feel like we were meant to find each other?",
            "What’s something about me that feels oddly familiar?",
            "How would you describe our connection to someone who’s never felt it?",
            "What makes our bond feel unbreakable?",
            "Do you believe we’ve met in another lifetime?",
            "What part of your life feels lighter because I’m in it?",
            "What’s the purest moment we’ve shared so far?",
            "How do you know you can be your truest self around me?",
            "What emotion do I bring out in you the most?",
            "What do you think our souls were meant to teach each other?",
            "What moment made you realize you could trust me fully?",
            "What’s something small that reminds you of me every day?",
            "How do we balance each other out?",
            "What kind of energy do we create together?",
            "If love had a color, what shade would ours be?",
            "What part of me feels like home to you?",
            "What would your life look like if we never met?",
            "What do you think keeps our souls connected even when apart?",
            "How have I helped you grow emotionally or spiritually?",
            "What’s a sign from the universe that reminds you of me?",
            "What song feels like our souls talking?",
            "What lesson has our love taught you?",
            "What does “forever” mean when you think of us?",
            "How do we help each other heal?",
            "What does it feel like when we’re completely in sync?",
            "When do you feel closest to my soul?",
            "What’s a dream you believe we’re meant to chase together?",
            "How would you describe our energy in one word?",
            "What makes our connection different from any love you’ve known?",
            "How do you know that you’ve truly found your soulmate?"
          ]
        },
        {
          "id": "couple-therapy",
          "name": "Couple Therapy",
          "questions": [
            "What’s one thing you wish we argued less about?",
            "How can we make each other feel more understood?",
            "What’s your love language, and how can I speak it better?",
            "What’s something I do that unintentionally hurts you?",
            "How do you prefer to be comforted when upset?",
            "What’s one boundary we should set to protect our peace?",
            "What’s a recent misunderstanding we can learn from?",
            "What’s your definition of a healthy relationship?",
            "What’s one promise we should make to each other today?",
            "How do you know I truly care, even during rough days?",
            "What triggers tension between us most often?",
            "How can we handle conflicts without shutting down?",
            "What helps you feel emotionally safe with me?",
            "What can I do to make you feel more seen or valued?",
            "How do you usually show forgiveness?",
            "What does trust mean to you now compared to before?",
            "What should we start doing to reconnect better?",
            "What’s one unhealthy pattern we’ve broken?",
            "How do we make love feel easy again after arguments?",
            "What do you need from me that you haven’t said out loud?",
            "How can we handle stress as a team?",
            "What’s one thing we could let go of to grow stronger?",
            "How can I show up better for you emotionally?",
            "What’s something you’re afraid to tell me but wish I’d understand?",
            "How can we rebuild connection when life gets busy?",
            "What’s one thing you’d like us to try differently this month?",
            "What do you think keeps couples from lasting — and how can we avoid it?",
            "What’s one way I can make communication easier for you?",
            "How do you know when we’re truly okay again after a fight?",
            "What would “our best version” as a couple look like to you?"
          ]
        },
        { "id": "naughty-nights", "name": "Naughty Nights", "questions": [] },
        { "id": "the-future-us", "name": "The Future Us", "questions": [] }
      ]
    }
  ]
}