{
  "categories": [
    {
      "id": "fun-zone",
      "name": "Fun Zone",
      "color": "#FFC300",
      "subcategories": [
        { "id": "would-you-rather", "name": "Would You Rather", "questions": [
          "Would you rather relive one perfect day or skip one painful memory forever?",
          "Would you rather read minds for a day or be unreadable forever?",
          "Would you rather always be 10 minutes early or 10 minutes late?",
          "Would you rather win every argument or never start any?",
          "Would you rather forget your favorite memory or never create a new one?",
          "Would you rather have unlimited time or unlimited energy?",
          "Would you rather travel the world for free or eat anywhere for free?",
          "Would you rather find true love or true purpose?",
          "Would you rather share your deepest secret or hear someone else’s?",
          "Would you rather be famous for talent or respected for character?",
          "Would you rather restart your life at age 10 or fast-forward to the future?",
          "Would you rather lose all your photos or all your messages?",
          "Would you rather be able to pause time or rewind time?",
          "Would you rather get one honest answer or one guaranteed wish?",
          "Would you rather keep your past or rewrite it completely?",
          "Would you rather live with no music or no movies?",
          "Would you rather live in your favorite memory or your dream future?",
          "Would you rather be loved loudly or quietly but deeply?",
          "Would you rather be known for your humor or your wisdom?",
          "Would you rather have a friend who’s brutally honest or gently supportive?",
          "Would you rather be able to erase one mistake or relive one success?",
          "Would you rather stay up late talking or fall asleep in peace?",
          "Would you rather cry from laughter or laugh from crying?",
          "Would you rather know the truth even if it hurts or stay comfortably unaware?",
          "Would you rather lose your ability to lie or your ability to trust?",
          "Would you rather explore the ocean or explore space?",
          "Would you rather be remembered as kind or unforgettable?",
          "Would you rather be emotionally transparent or emotionally mysterious?",
          "Would you rather have infinite confidence or infinite patience?",
          "Would you rather reveal a secret or hear someone reveal one about you?"
        ] },
        { "id": "juicy-convos", "name": "Juicy Convos", "questions": [
          "What’s the weirdest compliment someone’s ever given you?",
          "What rumor about you would make you laugh the most?",
          "What’s the boldest message you’ve ever sent someone?",
          "What’s a secret talent you rarely show?",
          "What’s something harmless that gives you way too much joy?",
          "What’s a moment that made you feel like the main character?",
          "What’s a harmless lie you told recently and why?",
          "What’s a trend you’re embarrassed you ever followed?",
          "What’s a guilty pleasure you’re surprisingly proud of?",
          "What’s one conspiracy theory you low-key believe?",
          "What’s something you wish people hyped you up for more?",
          "What’s the funniest way someone tried to impress you?",
          "What’s your most iconic comeback moment?",
          "What’s the most chaotic decision you made on impulse?",
          "What’s one thing you’d never admit on social media?",
          "What’s the most embarrassing thing your family knows about you?",
          "What’s a moment where you instantly regretted being nice?",
          "What’s a personality trait you pretend you don’t have?",
          "What’s a message you typed but never sent?",
          "What’s the most dramatic way you’ve ever exited a situation?",
          "What’s something you love but wish you didn’t?",
          "What’s one thing that can change your mood instantly?",
          "What’s a chaotic memory that still makes you laugh?",
          "What’s one thing people assume about you that’s totally wrong?",
          "What’s one thing you’d do differently if no one was watching?",
          "What’s a story you love telling even if it embarrasses you?",
          "What’s something you can’t resist bragging about?",
          "What’s a lie someone told you that you instantly knew was fake?",
          "What’s the worst “oops” moment you’ve ever tried to play off cool?",
          "What’s one thing you wish more people asked you about?"
        ] },
        { "id": "spicy-edition", "name": "Spicy Edition", "questions": [] }
      ]
    }
  ]
}