{
  "categories": [
    {
      "id": "emotional-zone",
      "name": "Emotional Zone",
      "color": "#9D4EDD",
      "subcategories": [
        {
          "id": "dream-talks",
          "name": "Dream Talks",
          "questions": [
            "What’s a dream you’ve never said out loud because it feels too big?",
            "If fear didn’t exist for 24 hours, what would you attempt?",
            "What’s a goal you’re secretly working on in your head?",
            "What’s something you stopped dreaming about but want to revive?",
            "What does your ideal future day look like from morning to night?",
            "What’s something you hope you’ll never lose passion for?",
            "What’s a dream you achieved that still doesn’t feel real?",
            "What’s a dream that scares you because it actually could happen?",
            "What’s something you want to learn but always delay?",
            "What’s a dream you had as a child that still lives inside you?",
            "What’s one thing that always motivates you no matter what?",
            "What part of your future do you think about the most?",
            "What dream feels impossible but you want anyway?",
            "What’s something that would make your younger self proud?",
            "What dream feels too personal to share with most people?",
            "What’s a dream that changed as you grew older?",
            "What’s a dream you let go of — and why?",
            "What’s your biggest dream for the next five years?",
            "What’s a dream you’d chase if money wasn’t a worry?",
            "What’s one step you could take toward a dream today?",
            "Whose support would mean the most in achieving your dream?",
            "What’s a dream you think others wouldn’t understand?",
            "What dream feels like it belongs to the world, not just you?",
            "What’s something you’re scared to want too badly?",
            "What dream feels like “home” when you imagine it?",
            "What’s a dream you’re afraid to say out loud because it might fail?",
            "What’s one thing you want your future self to thank you for?",
            "What’s a dream you’re willing to struggle for?",
            "What’s a dream you’d choose even if nobody supported it?",
            "What’s a dream you hope becomes part of your real story?"
          ]
        },
        { "id": "late-night-talks", "name": "Late Night Talks", "questions": [] },
        { "id": "toxic-truths", "name": "Toxic Truths", "questions": [] },
        { "id": "long-distance-vibes", "name": "Long Distance Vibes", "questions": [] }
      ]
    }
  ]
}