{
  "categories": [
    {
      "id": "friendship-zone",
      "name": "Friendship Zone",
      "color": "#4D96FF",
      "subcategories": [
        {
          "id": "for-best-friends",
          "name": "For Best Friends",
          "questions": [
            "What’s a moment in our friendship you’ll never forget?",
            "What’s one thing you can tell me but not anyone else?",
            "What’s the biggest way our friendship has changed you?",
            "What inside joke of ours still makes you laugh instantly?",
            "When did you first know we’d be close friends?",
            "What’s something you admire about me but never said?",
            "What’s your favorite adventure we’ve had together?",
            "What’s one thing we do that every friendship should try?",
            "What’s a risk you took because I encouraged you?",
            "What’s your favorite memory of us being chaotic?",
            "What’s something only I understand about you?",
            "Which of my habits reminds you of me even when I’m not around?",
            "What song instantly feels like “our friendship”?",
            "When did we laugh the hardest together?",
            "What’s the most meaningful conversation we’ve had?",
            "What’s something we’ve been through that made our bond stronger?",
            "If we lived together, what would be the funniest part?",
            "What’s something we should do together at least once in life?",
            "What do you think is the best part of having me as a friend?",
            "What personality trait of mine balances you out?",
            "What moment made you trust me fully?",
            "What’s something you wish we did more often?",
            "What’s one compliment you think I need to hear more?",
            "What’s a dream you want us to achieve together one day?",
            "What’s the weirdest thing we bonded over?",
            "What’s a memory of us that always makes you smile?",
            "What’s one tradition we should start as best friends?",
            "If we wrote a book together, what would it be about?",
            "What’s one thing you think we’ll joke about even when we’re old?",
            "What do you think makes our friendship so rare?"
          ]
        },
        {
          "id": "spill-the-tea",
          "name": "Spill the Tea",
          "questions": [
            "What’s something you discovered recently that shocked you?",
            "Who’s someone you trust a little less now, and why?",
            "What’s a truth you think people pretend not to know?",
            "What rumor did you hear that was surprisingly true?",
            "What’s the funniest drama you’ve ever witnessed?",
            "What’s something you pretend to like but secretly don’t?",
            "Who’s someone you used to admire but don’t anymore?",
            "What’s the biggest red flag you ignored in someone?",
            "What’s a lie people tell that annoys you instantly?",
            "What’s a trend everyone loves but you absolutely don’t get?",
            "Who’s the most unpredictable person you know?",
            "What’s the pettiest thing you’ve ever done?",
            "What’s a truth you learned the hard way?",
            "Who gives the worst advice, but says it confidently?",
            "What’s the funniest mistake someone’s made around you?",
            "What’s one secret crush you had that you laugh about now?",
            "What’s something people brag about that means nothing to you?",
            "Who changed the most since you first met them?",
            "What’s a “nice” person thing that actually gives you the ick?",
            "What’s something you know but wish you didn’t?",
            "Who’s the most drama-loving person in your circle?",
            "What’s one moment you realized someone was fake?",
            "What’s something petty you low-key loved watching unfold?",
            "Who’s someone you underestimated completely?",
            "What’s something messy you’re glad you walked away from?",
            "What’s a truth people refuse to accept?",
            "Who’s the funniest accidental villain you know?",
            "What’s your most iconic “I told you so” moment?",
            "What’s one tea you’ve been holding in for too long?",
            "What’s the most chaotic thing someone has ever confessed to you?"
          ]
        },
        {
          "id": "confessions",
          "name": "Confessions",
          "questions": [
            "What’s something you’ve never admitted out loud before?",
            "What’s a decision you still wonder about?",
            "What’s an apology you wish you had given sooner?",
            "What’s a dream you kept secret because it felt too big?",
            "What’s a fear you wish people understood better?",
            "What’s something you pretend doesn’t bother you—but does?",
            "What’s a compliment you struggle to accept?",
            "What memory still makes you blush?",
            "What’s one thing you outgrew but secretly miss?",
            "What’s something you wish someone had taught you earlier in life?",
            "What’s a promise you broke but regret deeply?",
            "What’s something you want to let go of this year?",
            "What’s something you said that you wish you could take back?",
            "What’s one thing you hide because you think people won’t get it?",
            "What’s a moment you still replay in your head?",
            "What’s something you forgave but never forgot?",
            "What’s one rule you break more often than you admit?",
            "What’s something you want to confess to your past self?",
            "What’s a feeling you struggle to put into words?",
            "What’s something you’ve been holding onto for too long?",
            "What’s the real reason you ended a friendship or relationship?",
            "What’s something you admire about others but don’t see in yourself?",
            "What’s a truth you realized only after losing something?",
            "What’s a lie you once believed about yourself?",
            "What’s a mistake that turned out to be a blessing?",
            "What’s something you wish people would ask you more often?",
            "What’s one thing you’re afraid people will judge you for?",
            "What’s the bravest thing you’ve done without telling anyone?",
            "What’s something you’re proud of but rarely talk about?",
            "What’s a feeling you miss the most from childhood?"
          ]
        },
        {
          "id": "getting-to-know-you",
          "name": "Getting to Know You",
          "questions": [
            "What’s something people notice about you only after knowing you well?",
            "What’s the hobby you love but rarely mention?",
            "What’s your personality like when you’re completely relaxed?",
            "What’s a belief you hold strongly?",
            "What’s something you value more than most people do?",
            "What’s the most “you” thing someone could gift you?",
            "What’s a habit you picked up recently that improved your life?",
            "What’s your comfort movie or show—and why?",
            "What’s one thing you’re unexpectedly good at?",
            "What’s something you wish people knew about you immediately?",
            "What’s a place where you feel most like yourself?",
            "What’s a small detail about you that says a lot?",
            "What’s a personality trait you’re proud of?",
            "What’s something that makes you feel instantly calm?",
            "What’s an experience that changed your perspective?",
            "What’s something you enjoy that surprises people?",
            "What’s the most thoughtful thing someone has done for you?",
            "What’s your hidden joy in daily life?",
            "What’s a comfort routine you can’t live without?",
            "What’s something you do that others find unusual?",
            "What motivates you the most?",
            "What’s a feeling you chase often?",
            "What’s the best compliment someone could give you?",
            "What’s something that instantly sparks your curiosity?",
            "What’s the weirdest but most accurate description of your personality?",
            "What’s a memory that perfectly describes who you are?",
            "What’s something you overthink too much?",
            "What’s one topic you can talk about for hours?",
            "What’s something that instantly makes your day better?",
            "What’s a question you wish people would ask you?"
          ]
        },
        {
          "id": "random-mix",
          "name": "Random Mix",
          "questions": [
            "What’s a decision you made impulsively that turned out great?",
            "What’s a random fact about yourself most people don’t know?",
            "What’s a goal you’re chasing this year?",
            "What’s the most unexpected place life took you?",
            "What’s something embarrassing that you now find hilarious?",
            "What’s a small win you’re proud of recently?",
            "What’s a moment you wish you could freeze forever?",
            "What’s something you never get tired of talking about?",
            "What’s a challenge you want to take on next?",
            "What’s one thing you refuse to settle for?",
            "What’s something you want to learn before the year ends?",
            "What’s a guilty pleasure that’s not really guilty to you?",
            "What’s a compliment you received that stuck with you?",
            "What’s a moment that made you unexpectedly emotional?",
            "What’s the best advice you rejected but later realized was true?",
            "What’s something you know you overdo?",
            "What’s a life lesson you learned from a stranger?",
            "What’s a risk you’re glad you took?",
            "What’s one thing you want to experience for the first time soon?",
            "What’s your favorite type of chaos?",
            "What’s a belief you recently challenged?",
            "What’s something you want to change about your routine?",
            "What’s a small thing that gives you a big serotonin boost?",
            "What’s a feeling you wish lasted longer?",
            "What’s something you outgrew in the best way?",
            "What’s a memory you didn’t appreciate until later?",
            "What’s something you’ve been postponing but shouldn’t?",
            "What’s one thing you want to be remembered for?",
            "What’s a moment where you surprised yourself?",
            "What’s something you want to say “yes” to more often?"
          ]
        }
      ]
    }
  ]
}